lib/partial_handler.rb

SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 ORDER BY "questionnaires"."id" DESC LIMIT $2  [["id", 60], ["LIMIT", 1]]
SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 ORDER BY "questionnaires"."id" DESC LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def find_current(partial=nil)
    id = params[:id] || params[:questionnaire_id]
    questionnaire = Questionnaire.where(id: id).last
    questionnaire ||= Questionnaire.where(uid: params[:questionnaire_uuid]).last