app/views/questionnaires/_data_info_form.html.erb

        <%= f.label "Select unit: .*." %>
        <%= f.select :size_format, DataInfo::SIZE_FORMAT, { include_blank: 'Select unit' }, { class: 'size_format_select select', required: true }  %>
---
SELECT  "data_infos".* FROM "data_infos" WHERE "data_infos"."questionnaire_id" = $1 LIMIT $2  [["questionnaire_id", 55], ["LIMIT", 1]]