app/controllers/questionnaires_controller.rb

SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."uid" IS NULL ORDER BY "questionnaires"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."id" = $1 ORDER BY "questionnaires"."id" DESC LIMIT $2  [["id", 39], ["LIMIT", 1]]
---
  def new
    params['questionnaire_uuid'] = 'a6778f0a-4d1b-446a-93ac-2dcae71bd1c4'
    params['previous_partial'] = 'related_info'
    @questionnaire = Questionnaire.where(uid: params['questionnaire_uuid']).last
    @questionnaire ||= Questionnaire.new
    @current_resource = @questionnaire
    @partial = 'keyword'
    @previous_partial = 'related_info'
    @hide_form = params['questionnaire_uuid']
    if request.xhr? || @hide_form
      params['current_partial'] = params['previous_partial'] || 'questionnaire'
      partial_handler = PartialHandler.new(params)
      @previous_partial = partial_handler.previous_partial
      @questionnaire, @current_resource, @partial = partial_handler.find_current(
          params['current_partial']
        )