app/models/contact.rb

INSERT INTO "contacts" ("questionnaire_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["questionnaire_id", 1], ["created_at", "2019-08-07 15:28:56.186160"], ["updated_at", "2019-08-07 15:28:56.186160"]]
---
  def person_or_contact
    if people.blank? && organizations.blank?
      errors.add(:base, "Please provide atleast one contact person or organization.")
    else
      self.save(validate: false)