app/models/questionnaire.rb

  def uuid
    _uuid = self.uid || SecureRandom.uuid
    if self.new_record?
      if Questionnaire.where(uid: _uuid).blank?
---
SELECT "questionnaires".* FROM "questionnaires" WHERE "questionnaires"."uid" = $1  [["uid", "ec7f9aa1-b314-4a6a-8d61-aa468dc3a4e4"]]